# UnlabelDimension Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GlobalParameter..::..UnlabelDimension Method
GlobalParameter Class See Also
---
Unlabels a dimension that is currently labeled by this global parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public void UnlabelDimension(
	ElementId dimensionId
)
```

Visual Basic
---
```text
Public Sub UnlabelDimension ( _
	dimensionId As ElementId _
)
```

Visual C++
---
```text
public:
void UnlabelDimension(
	ElementId^ dimensionId
)
```

# ### Parameters
dimensionId
    Type: Autodesk.Revit.DB..::..ElementId Id of a dimension element.
# Remarks
It is assumed that the given dimension element is presently labeled by this parameter. If it is not, this method throws an exception.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Given element Id is not of a valid dimension element. -or- The given dimension (dimensionId) is not labeled by this global parameter. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace